In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series

In [4]:
ser1 = Series([10,20,30,40,50])
ser1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
ser1 = Series([10,20,30,40,50],index=['A','B','C','D','E'])
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [6]:
type(ser1)

pandas.core.series.Series

In [7]:
ser1.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [8]:
ser1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [9]:
ser2 = Series({'BOM':'Mumbai','DEL':'Delhi','MAA':'Chennai'})

In [10]:
ser2

BOM     Mumbai
DEL      Delhi
MAA    Chennai
dtype: object

In [11]:
print(ser2)

BOM     Mumbai
DEL      Delhi
MAA    Chennai
dtype: object

In [12]:
ser3 = Series(np.random.randint(1,101,10))
ser3

0    93
1    40
2    72
3    48
4    84
5    42
6    97
7    17
8    44
9    86
dtype: int32

# Selection Techniques in Series

In [13]:
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

# Grab by Default Label

In [14]:
ser1[0]

10

In [15]:
ser1[-1]

50

# Grab by Label

In [16]:
ser1['A']

10

In [17]:
ser1['D']

40

# Grab by Range of Index / Slicing

In [18]:
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [19]:
ser1[1:3]

B    20
C    30
dtype: int64

In [20]:
ser1[:3]

A    10
B    20
C    30
dtype: int64

In [21]:
ser1[3:]

D    40
E    50
dtype: int64

# Grab by Multipe Labels

In [22]:
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [23]:
ser1[['A','D']]

A    10
D    40
dtype: int64

In [24]:
ser1[['B','E']]

B    20
E    50
dtype: int64

# Grab by Logic over Values

In [25]:
ser1

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [26]:
ser1 < 25

A     True
B     True
C    False
D    False
E    False
dtype: bool

In [27]:
ser1[ser1 < 25]

A    10
B    20
dtype: int64

# Q1. Fetch values which are between 15 and 35.

- & - and
- | - or

In [28]:
ser1[(ser1 > 15) & (ser1 < 35)]

B    20
C    30
dtype: int64

# Data Frame

In [29]:
from pandas import DataFrame

In [30]:
df1 = DataFrame(np.arange(1,26).reshape(5,5))
df1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [31]:
df1 = DataFrame(np.arange(1,26).reshape(5,5), index = ['A','B','C','D','E'])
df1

    0   1   2   3   4
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [32]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

In [33]:
df1 = DataFrame(np.arange(1,26).reshape(5,5), 
                index = list('ABCDE'),
               columns = ['Col1','Col2','Col3','Col4','Col5'])
df1

   Col1  Col2  Col3  Col4  Col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15
D    16    17    18    19    20
E    21    22    23    24    25

In [34]:
df1.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [35]:
df1.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Col5'], dtype='object')

In [36]:
df1.index[0]

'A'

In [37]:
df1.columns[:3]

Index(['Col1', 'Col2', 'Col3'], dtype='object')

# Creating DataFrame using List

In [38]:
df2 = DataFrame([['Ankit','Rai',24,'Male'],['Rashmi','Roy',26,'Female'],['Rahul','Mishra',20,'Male']])
df2

        0       1   2       3
0   Ankit     Rai  24    Male
1  Rashmi     Roy  26  Female
2   Rahul  Mishra  20    Male

In [39]:
df2 = DataFrame([['Ankit','Rai',24,'Male'],['Rashmi','Roy',26,'Female'],['Rahul','Mishra',20,'Male']],
               columns = ['First Name','Last Name','Age','Gender'],
               index = [101,102,103])
df2

    First Name Last Name  Age  Gender
101      Ankit       Rai   24    Male
102     Rashmi       Roy   26  Female
103      Rahul    Mishra   20    Male

# Create DataFrame using Dict

In [40]:
df3 = DataFrame({'First Name':['Ankit','Rashmi','Rahul'],'Last Name':['Rai','Roy','Mishra'],
                 'Age':np.random.randint(20,36,3),
                 'Gender':['Male','Female','Male']},index=[5,6,7])
df3

  First Name Last Name  Age  Gender
5      Ankit       Rai   22    Male
6     Rashmi       Roy   35  Female
7      Rahul    Mishra   23    Male

In [41]:
company = DataFrame({'Company':['Google','Facebook','Infosys','Wipro','Yahoo'],
                    'Ticker':['GOOG','FB','INFY','WIP','YAHO'],
                    'Price':np.random.randint(2000,5001,5)})
company

    Company Ticker  Price
0    Google   GOOG   4271
1  Facebook     FB   2092
2   Infosys   INFY   4661
3     Wipro    WIP   2538
4     Yahoo   YAHO   3404

# Selection of Entries - DataFrame

In [42]:
df1

   Col1  Col2  Col3  Col4  Col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15
D    16    17    18    19    20
E    21    22    23    24    25

# Grab by Column Name

In [43]:
df1['Col2']

A     2
B     7
C    12
D    17
E    22
Name: Col2, dtype: int32

# Grab by Multiple Column Name

In [44]:
df1[['Col2','Col3']]

   Col2  Col3
A     2     3
B     7     8
C    12    13
D    17    18
E    22    23

# Grab by range of Index Rows

In [45]:
df1[1:3]

   Col1  Col2  Col3  Col4  Col5
B     6     7     8     9    10
C    11    12    13    14    15

In [46]:
df1[:3]

   Col1  Col2  Col3  Col4  Col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15

# Grab by Logic on Column

In [47]:
df1

   Col1  Col2  Col3  Col4  Col5
A     1     2     3     4     5
B     6     7     8     9    10
C    11    12    13    14    15
D    16    17    18    19    20
E    21    22    23    24    25

In [48]:
df1['Col3'] > 15

A    False
B    False
C    False
D     True
E     True
Name: Col3, dtype: bool

In [49]:
df1[df1['Col3'] > 15]

   Col1  Col2  Col3  Col4  Col5
D    16    17    18    19    20
E    21    22    23    24    25

In [50]:
df2

    First Name Last Name  Age  Gender
101      Ankit       Rai   24    Male
102     Rashmi       Roy   26  Female
103      Rahul    Mishra   20    Male

# Q2. Fetch data of only males from df2

In [51]:
df2[df2['Gender'] == 'Male']

    First Name Last Name  Age Gender
101      Ankit       Rai   24   Male
103      Rahul    Mishra   20   Male

# Q3. Fetch data for male having age less than 23.

In [52]:
df2[(df2['Gender'] == 'Male') & (df2['Age'] < 23)]

    First Name Last Name  Age Gender
103      Rahul    Mishra   20   Male

In [53]:
df2[(df2['Gender'] == 'Male') | (df2['Age'] < 23)]

    First Name Last Name  Age Gender
101      Ankit       Rai   24   Male
103      Rahul    Mishra   20   Male

# How to add new column

In [54]:
df2

    First Name Last Name  Age  Gender
101      Ankit       Rai   24    Male
102     Rashmi       Roy   26  Female
103      Rahul    Mishra   20    Male

In [55]:
df2['Country'] = 'India'

In [56]:
df2

    First Name Last Name  Age  Gender Country
101      Ankit       Rai   24    Male   India
102     Rashmi       Roy   26  Female   India
103      Rahul    Mishra   20    Male   India

In [57]:
df2['Country'] = ['India','USA','India']

In [58]:
df2

    First Name Last Name  Age  Gender Country
101      Ankit       Rai   24    Male   India
102     Rashmi       Roy   26  Female     USA
103      Rahul    Mishra   20    Male   India

In [59]:
df2['Age']

101    24
102    26
103    20
Name: Age, dtype: int64

In [60]:
df2['Age'] + 10

101    34
102    36
103    30
Name: Age, dtype: int64

In [61]:
df2['Age'] * 10

101    240
102    260
103    200
Name: Age, dtype: int64

In [62]:
df2['Age after 20Years'] = df2['Age'] + 20

In [63]:
df2

    First Name Last Name  Age  Gender Country  Age after 20Years
101      Ankit       Rai   24    Male   India                 44
102     Rashmi       Roy   26  Female     USA                 46
103      Rahul    Mishra   20    Male   India                 40

# Create a total price column wich is include of 18% GST on price.

In [64]:
company

    Company Ticker  Price
0    Google   GOOG   4271
1  Facebook     FB   2092
2   Infosys   INFY   4661
3     Wipro    WIP   2538
4     Yahoo   YAHO   3404

In [65]:
company['Total Price'] = company['Price'] * 1.18

In [66]:
company

    Company Ticker  Price  Total Price
0    Google   GOOG   4271      5039.78
1  Facebook     FB   2092      2468.56
2   Infosys   INFY   4661      5499.98
3     Wipro    WIP   2538      2994.84
4     Yahoo   YAHO   3404      4016.72

# Functions related to Null Value

In [67]:
a = np.array([1,2,3,np.nan,np.nan])

In [68]:
a

array([ 1.,  2.,  3., nan, nan])

In [69]:
df4 = DataFrame({'A':[1,np.nan,np.nan,np.nan],'B':[2,5,8,np.nan],'C':[3,6,np.nan,np.nan]})

In [70]:
df4

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

# Convert data to boolean w.r.t null values

In [71]:
df4.isnull()

       A      B      C
0  False  False  False
1   True  False  False
2   True  False   True
3   True   True   True

In [72]:
df4.notnull()

       A      B      C
0   True   True   True
1  False   True   True
2  False   True  False
3  False  False  False

# Count of Null Values

In [73]:
df4.isnull().sum()

A    3
B    1
C    2
dtype: int64

# Percentage of null values in each column

In [74]:
len(df4)

4

In [75]:
df4.shape

(4, 3)

In [76]:
df4.shape[0]

4

In [77]:
df4.isnull().sum() / len(df4) * 100

A    75.0
B    25.0
C    50.0
dtype: float64

# Dropping row's or columns w.r.t Null

In [78]:
df4

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [79]:
df4.dropna()

     A    B    C
0  1.0  2.0  3.0

In [80]:
df4.dropna(axis=0) # Drop w.r.t row

     A    B    C
0  1.0  2.0  3.0

In [81]:
df4.dropna(axis=1) # Drop w.r.t column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [82]:
df4

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [83]:
df4.dropna(subset=['A']) # Checking null values in column A and then dropping the entire row according to that.

     A    B    C
0  1.0  2.0  3.0

In [84]:
df4.dropna(subset=['B'])

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN

# Filling null values

In [85]:
df4

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN
3  NaN  NaN  NaN

In [86]:
df4.fillna(0)

     A    B    C
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  0.0  8.0  0.0
3  0.0  0.0  0.0

In [87]:
df4['B'] = df4['B'].fillna(0)

In [88]:
df4

     A    B    C
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  NaN  8.0  NaN
3  NaN  0.0  NaN

# Concatenation in Series and DataFrame

In [89]:
ser1 = Series([10,20,30],index=['P','Q','R'])
ser2 = Series([40,50,60,70],index=list('STUV'))

In [90]:
ser1

P    10
Q    20
R    30
dtype: int64

In [91]:
ser2

S    40
T    50
U    60
V    70
dtype: int64

In [92]:
pd.concat([ser1,ser2])

P    10
Q    20
R    30
S    40
T    50
U    60
V    70
dtype: int64

In [93]:
pd.concat([ser1,ser2],axis=0)

P    10
Q    20
R    30
S    40
T    50
U    60
V    70
dtype: int64

In [94]:
pd.concat([ser1,ser2],axis=1)

      0     1
P  10.0   NaN
Q  20.0   NaN
R  30.0   NaN
S   NaN  40.0
T   NaN  50.0
U   NaN  60.0
V   NaN  70.0

In [95]:
df3 = DataFrame({'First Name':['Ankit','Rashmi','Rahul'],'Last Name':['Rai','Roy','Mishra'],
                 'Age':np.random.randint(20,36,3),
                 'Gender':['Male','Female','Male']},index=[1,2,3])
df3

  First Name Last Name  Age  Gender
1      Ankit       Rai   22    Male
2     Rashmi       Roy   34  Female
3      Rahul    Mishra   28    Male

In [96]:
df6 = DataFrame({'First Name':['Ankita','Shreya','Sprithi'],'Last Name':['R','Mohan','Kumar'],
                 'Age':np.random.randint(20,36,3),
                 'Gender':['Female','Female','Female']},index=[4,5,6])
df6

  First Name Last Name  Age  Gender
4     Ankita         R   35  Female
5     Shreya     Mohan   21  Female
6    Sprithi     Kumar   32  Female

In [97]:
df7 = pd.concat([df3,df6])
df7

  First Name Last Name  Age  Gender
1      Ankit       Rai   22    Male
2     Rashmi       Roy   34  Female
3      Rahul    Mishra   28    Male
4     Ankita         R   35  Female
5     Shreya     Mohan   21  Female
6    Sprithi     Kumar   32  Female

# Q4. Concatenate FN and Age from df3 and df6.

In [98]:
df7 = pd.concat([df3[['First Name','Age']],df6[['First Name','Age']]])
df7

  First Name  Age
1      Ankit   22
2     Rashmi   34
3      Rahul   28
4     Ankita   35
5     Shreya   21
6    Sprithi   32

In [99]:
df8 = DataFrame({'Country':['India','USA','India','India','USA','India'],
                 'City':['Mumbai','New York','Bangalore','Mumbai','New York','Bangalore'],
                 'Exp':np.random.randint(5,11,6)},index=[1,2,3,4,5,6])
df8

  Country       City  Exp
1   India     Mumbai    7
2     USA   New York    6
3   India  Bangalore    9
4   India     Mumbai    6
5     USA   New York    8
6   India  Bangalore    7

In [100]:
pd.concat([df7,df8],axis=1)

  First Name  Age Country       City  Exp
1      Ankit   22   India     Mumbai    7
2     Rashmi   34     USA   New York    6
3      Rahul   28   India  Bangalore    9
4     Ankita   35   India     Mumbai    6
5     Shreya   21     USA   New York    8
6    Sprithi   32   India  Bangalore    7

## Q6. Concatenate First Name and Age from df7 and Country and Exp from Df8.

In [101]:
pd.concat([df7[['First Name','Age']],df8[['Country','Exp']]],axis=1)

  First Name  Age Country  Exp
1      Ankit   22   India    7
2     Rashmi   34     USA    6
3      Rahul   28   India    9
4     Ankita   35   India    6
5     Shreya   21     USA    8
6    Sprithi   32   India    7

In [102]:
a = df7[['First Name','Age']]    
b = df8[['Country','Exp']]
pd.concat([a,b],axis=1)

  First Name  Age Country  Exp
1      Ankit   22   India    7
2     Rashmi   34     USA    6
3      Rahul   28   India    9
4     Ankita   35   India    6
5     Shreya   21     USA    8
6    Sprithi   32   India    7

# Group by

In [103]:
df9 = DataFrame({'First Name':['Ankita','Shreya','Sprithi','Rahul','Sree','Aniruddha'],
                 'Last Name':['R','Mohan','Kumar','Sharma','Verma','Kapoor'],
                 'Age':np.random.randint(20,36,6),
                 'Gender':['Female','Female','Female','Male','Male','Male'],'Country':['India','USA','India','India','USA','India'],
                 'City':['Mumbai','New York','Bangalore','Mumbai','New York','Bangalore'],
                 'Exp':np.random.randint(5,11,6)},index=[1,2,3,4,5,6])
df9

  First Name Last Name  Age  Gender Country       City  Exp
1     Ankita         R   27  Female   India     Mumbai    6
2     Shreya     Mohan   26  Female     USA   New York    8
3    Sprithi     Kumar   35  Female   India  Bangalore    5
4      Rahul    Sharma   23    Male   India     Mumbai    8
5       Sree     Verma   27    Male     USA   New York    5
6  Aniruddha    Kapoor   33    Male   India  Bangalore    9

# Find Average Age.

In [104]:
df9['Age'].mean()

28.5

# Average age w.r.t Gender

In [105]:
df9.groupby('Gender')['Age'].mean()

Gender
Female    29.333333
Male      27.666667
Name: Age, dtype: float64

# Maximum Experiance w.r.t City.

In [106]:
df9.groupby('City')['Exp'].max()

City
Bangalore    9
Mumbai       8
New York     8
Name: Exp, dtype: int32

# Mean of Age and Exp w.r.t Gender

In [107]:
df9.groupby('Gender')[['Age','Exp']].mean()

              Age       Exp
Gender
Female  29.333333  6.333333
Male    27.666667  7.333333

In [108]:
print(df2['Age'])

101    24
102    26
103    20
Name: Age, dtype: int64